; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 grey_door_1 yellow_door_1 yellow_door_2 - door
   purple_box_1 yellow_box_1 red_box_2 purple_box_2 red_box_1 - box
   purple_ball_1 grey_ball_1 blue_ball_1 - ball
 )
 (:init (agentinroom room_4) (objectinroom red_box_1 room_1) (objectinroom grey_ball_1 room_1) (objectinroom purple_box_1 room_1) (objectinroom purple_ball_1 room_3) (objectinroom red_box_2 room_3) (objectinroom yellow_box_1 room_3) (objectinroom purple_box_2 room_4) (objectinroom blue_ball_1 room_4) (objectcolor red_box_1 redtype) (objectcolor grey_ball_1 greytype) (objectcolor purple_box_1 purpletype) (objectcolor purple_ball_1 purpletype) (objectcolor red_box_2 redtype) (objectcolor yellow_box_1 yellowtype) (objectcolor purple_box_2 purpletype) (objectcolor blue_ball_1 bluetype) (objectcolor green_door_1 greentype) (objectcolor grey_door_1 greytype) (objectcolor yellow_door_1 yellowtype) (objectcolor yellow_door_2 yellowtype) (emptyhands) (locked green_door_1) (locked grey_door_1) (locked yellow_door_1) (locked yellow_door_2) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 grey_door_1) (adjacentrooms room_1 room_3 grey_door_1) (adjacentrooms room_4 room_2 yellow_door_1) (adjacentrooms room_2 room_4 yellow_door_1) (adjacentrooms room_4 room_3 yellow_door_2) (adjacentrooms room_3 room_4 yellow_door_2) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v redtype) (agentinroom room_3) (objectinroom ?v room_3) (emptyhands) (at_ ?v)))))
 (:constraints (always (locked yellow_door_2)) (sometime (agentinroom room_3)) (sometime-before (agentinroom room_3) (carrying red_box_1)) (sometime (agentinroom room_4)) (sometime-after (agentinroom room_4) (or (agentinroom room_1) (carrying grey_ball_1))))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_1 room_4 room_2)
   added: (at_ yellow_door_1)
   goals met: 0 of 1
2. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 0 of 1
3. (gotoroom room_4 room_2 yellow_door_1)
   deleted: (agentinroom room_4) (at_ yellow_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 1
4. (gotodoor green_door_1 room_2 room_1)
   added: (at_ green_door_1)
   goals met: 0 of 1
5. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 0 of 1
6. (gotoroom room_2 room_1 green_door_1)
   deleted: (agentinroom room_2) (at_ green_door_1)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
7. (gotodoor grey_door_1 room_1 room_3)
   added: (at_ grey_door_1)
   goals met: 0 of 1
8. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 0 of 1
9. (gotoobject red_box_1 room_1)
   deleted: (at_ grey_door_1)
   added: (at_ red_box_1)
   goals met: 0 of 1
10. (pick red_box_1 room_1)
   deleted: (at_ red_box_1) (emptyhands) (objectinroom red_box_1 room_1)
   added: (carrying red_box_1)
   goals met: 0 of 1
11. (gotoroom room_1 room_3 grey_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
12. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
13. (drop red_box_1 room_3)
   deleted: (carrying red_box_1) (at_ empty)
   added: (at_ red_box_1) (emptyhands) (objectinroom red_box_1 room_3)
   goals met: 1 of 1
